ТСД_файловая/src/DataProcessors/Розница/Розница.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>Розница</name>
  <tabularSections>
    <name>Документы</name>
    <attributes>
      <name>ИД_Документ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>18</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВсегоPKG</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СкладСборки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РК</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Короба</name>
    <attributes>
      <name>ИД_Короб</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИД_Документ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Принят</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерУпаковки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отсканирован</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СкладСборки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РК</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>ИД_Документ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИД_Короб</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Артикул</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихКод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>13</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеТовара</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеЕдиницы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПоставщика</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоВведено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоРасхождение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаРасхождения</name>
      <type>
        <types>CatalogRef.ПричиныВозврата</types>
      </type>
    </attributes>
    <attributes>
      <name>Весовой</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МРЦ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПриемДо</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

ТСД_файловая/src/InformationRegisters/РозницаДокументы/РозницаДокументы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РозницаДокументы</name>
  <attributes>
    <name>РК</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ИД_Документ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>18</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВсегоPKG</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ТСД_файловая/src/DataProcessors/Розница/Forms/ПриемТоваровРЦ/Module.bsl
&НаКлиенте
Перем ВыполняетсяЗакрытие;


	
	
	
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	ТипДокумента = Параметры.ТипДокумента;	
	ИнициализироватьКонстантыФормы();
	ОбновитьПодразделение();
	ОбновитьСотрудника();	
	
	НастроитьФормуПоЗначениямНастроек();
	ЗагрузитьСписокДокументовСервер();
	//	ЗагрузитьСохраненныеДанные();	
//	Элементы.ФормаКоманднаяПанель.Видимость = Ложь;
	//ЭтаФорма.ОтображатьКнопкуЗакрытия = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВыполняетсяЗакрытие = Ложь; 
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаСообщение", "Видимость",Ложь);
    
	#Если МобильноеПриложениеКлиент Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "Сканировать", "Видимость", Ложь);
	#КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	
	Если ВыполняетсяЗакрытие Тогда
		ОбщегоНазначенияКлиентСервер.ОчиститьСотрудника(); 
		СохранитьТекущиеДанные()
	Иначе
		Отказ = Истина;    
		
		
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить("Да", "Так");
		Кнопки.Добавить("Нет", "Ні");
		ПараметрыНапоминания = Новый Структура;
	//	ПараметрыНапоминания.Вставить("Картинка", БиблиотекаКартинок.Информация32);
		ПараметрыНапоминания.Вставить("Заголовок", "Увага");
		ПараметрыНапоминания.Вставить("ПредлагатьБольшеНеЗадаватьЭтотВопрос", Ложь);
		СтандартныеПодсистемыКлиент.ПоказатьВопросПользователю(
			Новый ОписаниеОповещения("ПередЗакрытиемЗавершение",ЭтотОбъект), "Закрити документ?", Кнопки, ПараметрыНапоминания);

		//ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗакрытиемЗавершение",ЭтотОбъект),"Закрити документ?",РежимДиалогаВопрос.ДаНет);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ПодключаемоеОборудованиеКлиент.ЭтоОповещениеСканераШтрихкода(ИмяСобытия) И ВводДоступен() Тогда
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("Форма", ЭтаФорма);
		ОбработатьПолученныйШтрихкод(Параметр, ДополнительныеПараметры);
		
	ИначеЕсли ИмяСобытия = "ИзмененоПодразделение" Тогда
		
		ОбновитьПодразделение();
		
	ИначеЕсли ИмяСобытия = "ИзмененСотрудник" Тогда
		
		ОбновитьСотрудника();
		
		Если ПользовательИнициализирован И ОтсканированPKG = Ложь Тогда
			  ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаСообщение", "Видимость",Истина);
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры




////    

&НаСервере
Процедура ЗагрузитьСохраненныеДанные()
	
	Если ТипДокумента <> Справочники.ТипыДокументов.ПриемPKG Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РозницаДокументы.ИД_Документ КАК ИД_Документ,
		|	РозницаДокументы.Номер КАК Номер,
		|	РозницаДокументы.Дата КАК Дата,
		|	РозницаДокументы.ВидДокумента КАК ВидДокумента,
		|	РозницаДокументы.ВсегоPKG КАК ВсегоPKG,
		|	РозницаДокументы.РК КАК РК
		|ИЗ
		|	РегистрСведений.РозницаДокументы КАК РозницаДокументы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РозницаТовары.ИД_Документ КАК ИД_Документ,
		|	РозницаТовары.ИД_Короб КАК ИД_Короб,
		|	РозницаТовары.Артикул КАК Артикул,
		|	РозницаТовары.МРЦ КАК МРЦ,
		|	РозницаТовары.Коэффициент КАК Коэффициент,
		|	РозницаТовары.ШтрихКод КАК ШтрихКод,
		|	РозницаТовары.НаименованиеТовара КАК НаименованиеТовара,
		|	РозницаТовары.НаименованиеЕдиницы КАК НаименованиеЕдиницы,
		|	РозницаТовары.КоличествоПоставщика КАК КоличествоПоставщика,
		|	РозницаТовары.КоличествоВведено КАК КоличествоВведено,
		|	РозницаТовары.КоличествоРасхождение КАК КоличествоРасхождение,
		|	РозницаТовары.ПричинаРасхождения КАК ПричинаРасхождения,
		|	РозницаТовары.Весовой КАК Весовой,
		|	РозницаТовары.ПриемДо КАК ПриемДо
		|ИЗ
		|	РегистрСведений.РозницаТовары КАК РозницаТовары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РозницаКороба.ИД_Короб КАК ИД_Короб,
		|	РозницаКороба.ИД_Документ КАК ИД_Документ,
		|	РозницаКороба.Принят КАК Принят,
		|	РозницаКороба.НомерУпаковки КАК НомерУпаковки,
		|	РозницаКороба.Отсканирован КАК Отсканирован,
		|	РозницаКороба.СкладСборки КАК СкладСборки,
		|	РозницаКороба.РК КАК РК
		|ИЗ
		|	РегистрСведений.РозницаКороба КАК РозницаКороба";
	
	ПакетЗапроса = Запрос.ВыполнитьПакет();
	РезультатДокументы = ПакетЗапроса[0];  
	Если РезультатДокументы.Пустой() Тогда
		Возврат;
	КонецЕсли;
	РезультатКороба = ПакетЗапроса[2];
	ВыборкаКороба = РезультатКороба.Выбрать();
	Пока ВыборкаКороба.Следующий() Цикл  
		СтрокаКороба = ПолучитьСтрокуКороб(ВыборкаКороба.ИД_Документ,ВыборкаКороба.ИД_Короб);;
		Если СтрокаКороба = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(СтрокаКороба,ВыборкаКороба,,"СкладСборки");
	КонецЦикла;

	
	ВыборкаДокументы = РезультатДокументы.Выбрать(); 
	Пока ВыборкаДокументы.Следующий() Цикл  
		СтрокаДокумент = ПолучитьСтрокуДокумент(ВыборкаДокументы.ИД_Документ);
		Если СтрокаДокумент = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(СтрокаДокумент,ВыборкаДокументы); 
		СтрокаДокумент.ПринятоPKG = ПринятоPKGДокумента(СтрокаДокумент.ИД_Документ);	

		СтрокаДокумент.ЗаписьПоСтроке = "Прийнято PKG - "+СтрокаДокумент.ПринятоPKG+" з "+СтрокаДокумент.ВсегоPKG+Символы.ПС+СтрокаДокумент.СкладСборки;
	КонецЦикла;

	РезультатТовары = ПакетЗапроса[1];
	ВыборкаТовары = РезультатТовары.Выбрать();
	Пока ВыборкаТовары.Следующий() Цикл   
		СтрокаДокумент = ПолучитьСтрокуДокумент(ВыборкаТовары.ИД_Документ);
		Если СтрокаДокумент = Неопределено Тогда
			Продолжить;
		КонецЕсли;

		СтрокаТовары = ПолучитьСтрокуТоваров(ВыборкаТовары.ИД_Документ,ВыборкаТовары.ИД_Короб,ВыборкаТовары.Артикул,ВыборкаТовары.МРЦ,Истина);
		ЗаполнитьЗначенияСвойств(СтрокаТовары,ВыборкаТовары);
	КонецЦикла;
	
	

КонецПроцедуры

&НаСервере
Процедура ЗагрузитьСписокДокументовСервер() 
	СтруктураОтвет = РозницаТК.ПолучитьСписокДокументовPKG(ТипДокумента); 
	
	Если  Не СтруктураОтвет.Результат Тогда
		
		Если НЕ ПустаяСтрока(СтруктураОтвет.ОписаниеОшибки) Тогда
			Сообщить(СтруктураОтвет.ОписаниеОшибки);
		Иначе 
			Сообщить("Помилка отримання списка PKG");
		КонецЕсли;
		Возврат;
		
	КонецЕсли;
	ДоставкаRK = СтруктураОтвет.Ответ.RK;   
	 ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СообщениеПользователю", "Заголовок",?(ДоставкаRK = 1,"Відскануйте RK","Відскануйте PKG"));
	
	МассивДокументов = СтруктураОтвет.Ответ.МассивДокументов;
	Для Каждого СтрокаДокумент из  МассивДокументов Цикл 
		мДокументы = Объект.Документы.НайтиСтроки(Новый Структура("ИД_Документ",СтрокаДокумент.ОснованиеUUID));
		
		Если мДокументы.Количество() Тогда
			НоваяСтрокаДокумент = мДокументы[0];
		Иначе   
			НоваяСтрокаДокумент = Объект.Документы.Добавить();  
		КонецЕсли; 
		
		НоваяСтрокаДокумент.ИД_Документ = СтрокаДокумент.ОснованиеUUID; 
		НоваяСтрокаДокумент.Номер =СтрокаДокумент.Номер; 
		НоваяСтрокаДокумент.Дата =СтрокаДокумент.Дата; 
		НоваяСтрокаДокумент.ВидДокумента ="Переміщення"; 
		НоваяСтрокаДокумент.ВсегоPKG = СтрокаДокумент.ВсегоPKG;  
		НоваяСтрокаДокумент.СкладСборки = СтрокаДокумент.СкладОтправитель;  	
		Для Каждого СтрокаПКГ Из СтрокаДокумент.МассивPKG Цикл 
			
			мКороба = Объект.Короба.НайтиСтроки(Новый Структура("ИД_Короб,ИД_Документ",СтрокаПКГ.ИД_Короб,СтрокаДокумент.ОснованиеUUID));
			//
			Если НЕ мКороба.Количество() Тогда
				СтрокаКороб = Объект.Короба.Добавить();
				СтрокаКороб.ИД_Короб = СтрокаПКГ.ИД_Короб;
				СтрокаКороб.ИД_Документ = СтрокаДокумент.ОснованиеUUID;
				СтрокаКороб.НомерУпаковки = СтрокаПКГ.НомерУпаковки;  
				СтрокаКороб.СкладСборки = СтрокаПКГ.СкладСборки;
				Если ПредварительныйПрием И СтрокаПКГ.Состояние = 2 Тогда
					СтрокаКороб.Принят = 1;
				КонецЕсли;
			КонецЕсли; 
		КонецЦикла;  
		НоваяСтрокаДокумент.ПринятоPKG = ПринятоPKGДокумента(НоваяСтрокаДокумент.ИД_Документ);	
		НоваяСтрокаДокумент.ЗаписьПоСтроке = "Прийнято PKG - "+НоваяСтрокаДокумент.ПринятоPKG+" з "+СтрокаДокумент.ВсегоPKG+Символы.ПС+НоваяСтрокаДокумент.СкладСборки;
		
	КонецЦикла; 
	
	Объект.Документы.Сортировать("СкладСборки");
	Если Объект.Документы.Количество() > 0 Тогда
		ЗагрузитьСохраненныеДанные();   
	КонецЕсли;
	
КонецПроцедуры



&НаСервере
Процедура СохранитьТекущиеДанные()
	Если ТипДокумента <> Справочники.ТипыДокументов.ПриемPKG Тогда
		Возврат;
	КонецЕсли;
	
	НаборДокументы = РегистрыСведений.РозницаДокументы.СоздатьНаборЗаписей();
	НаборДокументы.Загрузить(Объект.Документы.Выгрузить());
	НаборДокументы.Записать();
	
	НаборКороба = РегистрыСведений.РозницаКороба.СоздатьНаборЗаписей();
	НаборКороба.Загрузить(Объект.Короба.Выгрузить());
	НаборКороба.Записать();
	
	НаборТовары = РегистрыСведений.РозницаТовары.СоздатьНаборЗаписей();
	НаборТовары.Загрузить(Объект.Товары.Выгрузить());
	НаборТовары.Записать();
	
	
КонецПроцедуры


&НаСервере
Процедура ИнициализироватьКонстантыФормы()
	
	ИспользуетсяАсинхронныйСканер = ЗначениеНастроекВызовСервераПовтИсп.ИспользуетсяАсинхронныйСканерШтрихкодов();
	Инициализирован = НЕ ПустаяСтрока(ПараметрыСеанса.Подразделение);
    ПользовательИнициализирован = НЕ ПустаяСтрока(ПараметрыСеанса.Сотрудник);
КонецПроцедуры
 
&НаСервере
Процедура ОбновитьПодразделение()
	
	Если ПустаяСтрока(ПараметрыСеанса.Подразделение) Тогда
		Элементы.СообщениеИнициализации.Заголовок = "Пристрій не ініціалізований";
		ОбщегоНазначения.УстановитьЦветПолейОшибок(ЭтаФорма, "СообщениеИнициализации");
		Инициализирован = Ложь;
		
	Иначе

		Элементы.СообщениеИнициализации.Заголовок = ПараметрыСеанса.Подразделение;
		ОбщегоНазначения.УстановитьЦветИнформационныхНадписей(ЭтаФорма, "СообщениеИнициализации");
		Инициализирован = Истина;
		
	КонецЕсли;
	
	ОпределитьДоступностьКнопкиСканирования();
	
КонецПроцедуры

 &НаСервере
Процедура ОбновитьСотрудника()
	
	Если ПустаяСтрока(ПараметрыСеанса.Сотрудник) Тогда
		Элементы.СообщениеИнициализацииПользователя.Заголовок = "Користувач не ініціалізований";
		ОбщегоНазначения.УстановитьЦветПолейОшибок(ЭтаФорма, "СообщениеИнициализацииПользователя");
		ПользовательИнициализирован = Ложь;
	Иначе
		Элементы.СообщениеИнициализацииПользователя.Заголовок = ПараметрыСеанса.Сотрудник;
		ОбщегоНазначения.УстановитьЦветИнформационныхНадписей(ЭтаФорма, "СообщениеИнициализацииПользователя");
		ПользовательИнициализирован = Истина;
	КонецЕсли;
	
	УстановитьДоступностьПоНастройкам();
	
КонецПроцедуры

 &НаСервере
Процедура ОпределитьДоступностьКнопкиСканирования()
	
	ЕстьОборудованиеСканирования = ЗначениеЗаполнено(ЗначениеНастроекВызовСервераПовтИсп.ТипУстройстваСканирования());
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "Сканировать", "Видимость",
	(ЕстьОборудованиеСканирования И НЕ ИспользуетсяАсинхронныйСканер) И Инициализирован И ПользовательИнициализирован
	);
	
КонецПроцедуры   

 &НаСервере
Процедура НастроитьФормуПоЗначениямНастроек()
	
		
	//ОбщегоНазначения.УстановитьШрифт(ЭтаФорма);
	
	ОпределитьДоступностьКнопкиСканирования();
	
	НастроитьЭлементыАсинхронногоСканера();
	Если ТипДокумента = Справочники.ТипыДокументов.БезакцептныйПриемPKG Тогда
		ЭтотОбъект.Заголовок = "Безакцептний прийом PKG";
		ПредварительныйПрием = Истина;
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьПоНастройкам()

	ОпределитьДоступностьКнопкиСканирования();
	
//	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "Сканировать", "Доступность", Инициализирован И ПользовательИнициализирован);
 	
	
КонецПроцедуры

 &НаСервере
Процедура НастроитьЭлементыАсинхронногоСканера()
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "АктивироватьСканер", "Видимость", 
		ИспользуетсяАсинхронныйСканер
	);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(РезультатВопроса,ДопоплнительныеПараметры) Экспорт
	
	Если РезультатВопроса = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если РезультатВопроса.Значение = "Да" Тогда
		ВыполняетсяЗакрытие = Истина;
		Закрыть();
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеЗакрытияВводаСотрудника(Результат,ДополнительныеПараметры)Экспорт 
	
КонецПроцедуры


    
&НаКлиенте
Процедура ОбработатьПолученныйШтрихкод(ПолученныйШтрихкод, Параметры) Экспорт
	
	Если ПустаяСтрока(ПолученныйШтрихкод) Тогда
		Возврат;
	КонецЕсли;
	
	
	Если НЕ ПользовательИнициализирован Тогда
		
		Результат	= ИнтеграцияТК_Клиент.ПолучитьСотрудника(ПолученныйШтрихкод);

		Если Результат.Результат Тогда
			Оповестить("ИзмененСотрудник");
		Иначе
			Сообщить("Необхідна авторизація користувача");
		КонецЕсли;
		
		Возврат;
	ИначеЕсли ПользовательИнициализирован И ОтсканированPKG  Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаСообщение", "Видимость",Ложь);
		
	КонецЕсли;
	
	Если ПредварительныйПрием Тогда
		
		Если СтрЧислоВхождений(ПолученныйШтрихкод,";")=2 Тогда
			ОчиститьСообщения();
			МассивСтрок = СтрРазделить(ПолученныйШтрихкод,";");
			ИД_PKG = МассивСтрок[0];
			
			ДанныеПКГ(ИД_PKG);  
			ПодсветитьСтроку(ТекИдентификаторСтроки);
		ИначеЕсли СтрНачинаетсяС(ПолученныйШтрихкод,"RK;") Тогда  
			МассивРК = СтрРазделить(ПолученныйШтрихкод,";");	 
			РКUUID = МассивРК[1]; 

			ДанныеПКГ(РКUUID,Истина);  
			ПодсветитьСтроку(ТекИдентификаторСтроки);

		Иначе
			ОбработкаФормыКлиент.ЗвукОшибки();	
		КонецЕсли;
		
	Иначе
		Если СтрЧислоВхождений(ПолученныйШтрихкод,";")=2 Тогда
			ОчиститьСообщения();
			МассивСтрок = СтрРазделить(ПолученныйШтрихкод,";");
			ИД_PKG = МассивСтрок[0];
			
			ДанныеПКГ(ИД_PKG);  
			ПодсветитьСтроку(ТекИдентификаторСтроки);
			
			//Если ПредварительныйПрием Тогда
			//	Возврат;
			//КонецЕсли;
			
			
			мКороба = Объект.Короба.НайтиСтроки(Новый Структура("ИД_Короб",ИД_PKG));
			Если мКороба.Количество() = 0 Тогда
				Возврат;
			КонецЕсли;
			СтрокаКороб = мКороба[0];
			//Если СтрокаКороб.Принят Тогда
			//	Возврат;
			//КонецЕсли;  
			ОписаниеОповещения = Новый ОписаниеОповещения("ОповещениеПриемТоваровPKG", ЭтотОбъект);
			ОткрытьФорму("Обработка.Розница.Форма.ФормаТоварыКороба"
			,Новый Структура("ТипДокумента,ИД_Короб,ИД_Документ,Товары,Документы,Короба",ТипДокумента,СтрокаКороб.ИД_Короб,СтрокаКороб.ИД_Документ,Объект.Товары,Объект.Документы,Объект.Короба)
			,ЭтотОбъект,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);	
		Иначе
			ОбработкаФормыКлиент.ЗвукОшибки();	
		КонецЕсли;                 
	КонецЕсли;
	
	
КонецПроцедуры 


&НаСервере 
Функция ПолучитьСтрокуТоваров(ИД_Документ,ИД_Короб,Артикул,МРЦ,ДобавлятьСтроку = Ложь)
	
	мКороба = Объект.Товары.НайтиСтроки(Новый Структура("ИД_Документ,ИД_Короб,Артикул,МРЦ",ИД_Документ,ИД_Короб,Артикул,МРЦ));
	
	Если НЕ мКороба.Количество() Тогда     
		Если ДобавлятьСтроку Тогда
			СтрокаТоварыКороб = Объект.Товары.Добавить();
			СтрокаТоварыКороб.ИД_Документ = ИД_Документ;
			СтрокаТоварыКороб.ИД_Короб    = ИД_Короб;
			СтрокаТоварыКороб.Артикул     = Артикул;  
			СтрокаТоварыКороб.МРЦ     = МРЦ;    
		Иначе   
			СтрокаТоварыКороб = Неопределено;
		КонецЕсли;
	Иначе
		 СтрокаТоварыКороб = мКороба[0];
	КонецЕсли;
	
	Возврат СтрокаТоварыКороб;
	
КонецФункции

&НаСервере 
Функция ПолучитьСтрокуКороб(ИД_Документ,ИД_Короб,Добавлять = Ложь)
	
	мКороба = Объект.Короба.НайтиСтроки(Новый Структура("ИД_Документ,ИД_Короб",ИД_Документ,ИД_Короб)); 
	Если НЕ мКороба.Количество() Тогда 
		Если Добавлять Тогда
			СтрокаКороб = Объект.Короба.Добавить();
			СтрокаКороб.ИД_Документ = ИД_Документ;
			СтрокаКороб.ИД_Короб = ИД_Короб;
		Иначе
			СтрокаКороб = Неопределено;	
		КонецЕсли;
	Иначе   
		СтрокаКороб = мКороба[0]; 
	КонецЕсли;
	
	Возврат СтрокаКороб 
	
КонецФункции 
&НаСервере 
Функция ПолучитьСтрокуДокумент(ИД_Документ,ДобавлятьСтроку = Ложь)
	
	мДокумент = Объект.Документы.НайтиСтроки(Новый Структура("ИД_Документ",ИД_Документ)); 
	Если НЕ мДокумент.Количество() Тогда 
		Если ДобавлятьСтроку Тогда
			СтрокаДокумент = Объект.Документы.Добавить();
			СтрокаДокумент.ИД_Документ = ИД_Документ;
		Иначе  
			СтрокаДокумент = Неопределено;
		КонецЕсли;
		
	Иначе   
		СтрокаДокумент = мДокумент[0]; 
	КонецЕсли;
	
	Возврат СтрокаДокумент 
	
КонецФункции

&НаСервере
Функция ПринятоPKGДокумента(ИД_Документ)
	мКороба = Объект.Короба.НайтиСтроки(Новый Структура("ИД_Документ,Принят",ИД_Документ,1));
	Возврат мКороба.Количество();
КонецФункции


&НаСервере  
Процедура ДанныеПКГ(ИД_PKG,Это_RK=Ложь)
	
	
	ТекИдентификаторСтроки = 1000;
	
	Если Это_RK Тогда
		СтруктураОтвет = РозницаТК.ПолучитьДанныеPKG_На_РК(ИД_PKG); 
	Иначе
		СтруктураОтвет = РозницаТК.ПолучитьДанныеPKG(ИД_PKG,ПредварительныйПрием); 
	КонецЕсли;
	
	Если  Не СтруктураОтвет.Результат Тогда
		
		Если НЕ ПустаяСтрока(СтруктураОтвет.ОписаниеОшибки) Тогда
			Сообщить(СтруктураОтвет.ОписаниеОшибки);
		Иначе 
			Сообщить("Помилка отримання PKG");
			
		КонецЕсли;
		Возврат;
		
	КонецЕсли;
	
	Если Это_RK Тогда
		МассивPKG = СтруктураОтвет.Ответ.МассивДокументов;
		Для Каждого СтрокаPKG Из МассивPKG Цикл 
			мДокументы = Объект.Документы.НайтиСтроки(Новый Структура("ИД_Документ",СтрокаPKG.ИД_Документ));
			Если мДокументы.Количество() Тогда
				СтрокаДокумент = мДокументы[0];
			Иначе
				Сообщить("Помилка отримання PKG - "+СтрокаPKG.Номер +" від "+Формат(СтрокаPKG.Дата,"ДФ=dd.MM.yy"));
				Продолжить;
			КонецЕсли;      
			СтрокаДокумент.РК = 1;
			ТекИдентификаторСтроки = СтрокаДокумент.ПолучитьИдентификатор();
			мКороба = Объект.Короба.НайтиСтроки(Новый Структура("ИД_Короб,ИД_Документ",СтрокаPKG.ИД_PKG,СтрокаPKG.ИД_Документ)); 
			Если мКороба.Количество() Тогда 
				СтрокаКороб = мКороба[0]; 
			Иначе 
				Сообщить("Помилка отримання PKG - "+СтрокаPKG.Номер +" від "+Формат(СтрокаPKG.Дата,"ДФ=dd.MM.yy"));

				Продолжить;
			КонецЕсли;
			СтрокаКороб.Отсканирован = 1;
			СтрокаКороб.Принят = 1;
            СтрокаКороб.РК = 1;
            СтрокаДокумент.РК = 1;
			СтрокаДокумент.ПринятоPKG = ПринятоPKGДокумента(СтрокаPKG.ИД_Документ);
			СтрокаДокумент.ЗаписьПоСтроке = "Прийнято PKG - "+СтрокаДокумент.ПринятоPKG+" з "+СтрокаДокумент.ВсегоPKG+Символы.ПС+СтрокаДокумент.СкладСборки;

		КонецЦикла;
		
		
		Возврат;	
	КонецЕсли;
	
	
	
	
	СтруктураPKG = СтруктураОтвет.Ответ;
	Если СтруктураPKG.stat = 0 Тогда
		Сообщить("ВАЖЛИВО!"+Символы.ПС+СтруктураPKG.info);
		Возврат;
	КонецЕсли;
	ИД_Документ = СтруктураPKG.Основание.ОснованиеUUID; 
	мДокументы = Объект.Документы.НайтиСтроки(Новый Структура("ИД_Документ",ИД_Документ));
	
	Если мДокументы.Количество() Тогда
		СтрокаДокумент = мДокументы[0];
	Иначе   
		СтрокаДокумент = Объект.Документы.Добавить();
	КонецЕсли;   

	ТекИдентификаторСтроки = СтрокаДокумент.ПолучитьИдентификатор();
	
	СтрокаДокумент.ИД_Документ = ИД_Документ; 
	СтрокаДокумент.Номер =СтруктураPKG.Основание.Номер; 
	СтрокаДокумент.Дата =СтруктураPKG.Основание.Дата; 
	СтрокаДокумент.ВидДокумента ="Переміщення"; 
	СтрокаДокумент.ВсегоPKG = СтруктураPKG.Основание.КоличествоPKG;        
	
	
	
	мКороба = Объект.Короба.НайтиСтроки(Новый Структура("ИД_Короб,ИД_Документ",ИД_PKG,ИД_Документ));
	
	Если НЕ мКороба.Количество() Тогда
		СтрокаКороб = Объект.Короба.Добавить();
		СтрокаКороб.ИД_Короб = ИД_PKG;
		СтрокаКороб.ИД_Документ = ИД_Документ;
		СтрокаКороб.НомерУпаковки = СтруктураPKG.НомерУпаковки;
		СтрокаКороб.Отсканирован = 1;
		Если ПредварительныйПрием Тогда
			СтрокаКороб.Принят = 1;
		КонецЕсли;
	Иначе  
		СтрокаКороб = мКороба[0]; 
		СтрокаКороб.Отсканирован = 1;
		Если ПредварительныйПрием Тогда
			СтрокаКороб.Принят = 1;
		КонецЕсли;

	КонецЕсли; 
	СтрокаДокумент.ПринятоPKG = ПринятоPKGДокумента(ИД_Документ);
	СтрокаДокумент.ЗаписьПоСтроке = "Прийнято PKG - "+СтрокаДокумент.ПринятоPKG+" з "+СтрокаДокумент.ВсегоPKG+Символы.ПС+СтрокаДокумент.СкладСборки;

	
	Если СтруктураPKG.Свойство("ТоварыPKG") Тогда    
		Для Каждого стрТоварыPKG Из  СтруктураPKG.ТоварыPKG Цикл 
			СтрокаТоваров = ПолучитьСтрокуТоваров(ИД_Документ,ИД_PKG,стрТоварыPKG.Артикул,стрТоварыPKG.МРЦ,Истина);  
			СтрокаТоваров.НаименованиеТовара = стрТоварыPKG.Tovar;
			СтрокаТоваров.НаименованиеЕдиницы = стрТоварыPKG.ЕдИзм;
			СтрокаТоваров.Коэффициент = стрТоварыPKG.Коф;
			СтрокаТоваров.КоличествоПоставщика = стрТоварыPKG.Кол;
			СтрокаТоваров.Весовой  = стрТоварыPKG.фВес;
			СтрокаТоваров.МРЦ   = стрТоварыPKG.МРЦ;     
			
			Если стрТоварыPKG.Свойство("sht") Тогда
				Если стрТоварыPKG.Свойство("sht2")	И стрТоварыPKG.sht2 <> 0 Тогда  
					СтрокаТоваров.ПриемДо = ТекущаяДата()+(стрТоварыPKG.sht/100)*стрТоварыPKG.sht2*86400-864000;
				Иначе
					СтрокаТоваров.ПриемДо = ТекущаяДата()+(стрТоварыPKG.sht/3*2)*86400-864000;
				КонецЕсли
			КонецЕсли;
		КонецЦикла;  
	КонецЕсли;
	

КонецПроцедуры



&НаКлиенте
Процедура АктивироватьСканер(Команда)
	
	ИнициализироватьАсинхронныйСканер();
	
КонецПроцедуры 

 &НаКлиенте
Процедура ИнициализироватьАсинхронныйСканер()
	
	ПодключаемоеОборудованиеКлиент.ИнициализироватьАсинхронныйСканер(ЭтаФорма);
	
КонецПроцедуры 


&НаКлиенте
Процедура Сканировать(Команда)
	
	ИдетПроцессСканирования = Истина;
	ОткрытьДиалогСканирования();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДиалогСканирования()
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", ЭтаФорма);
	ДополнительныеПараметры.Вставить("ПотоковоеСканирование");
	ДополнительныеПараметры.Вставить("ЗаголовокСканирования", НСтр("ru = 'Считайте штрих-код'"));
	ДополнительныеПараметры.Вставить("ИмяОбработчикаЗакрытияСканирования", "ОбработкаЗакрытияСканирования");
	
	ПодключаемоеОборудованиеКлиент.ПолучитьШтрихкод(ДополнительныеПараметры);
	
КонецПроцедуры

 &НаКлиенте
Процедура СообщениеИнициализацииПользователяНажатие(Элемент)
	ДополнительныеПараметры = Новый Структура;
	ДопПарметрыФормы = Новый Структура;
	опЗакрытие = Новый ОписаниеОповещения("ВыполнитьПослеЗакрытияВводаСотрудника",ЭтаФорма,ДополнительныеПараметры);
	ОткрытьФорму("Обработка.Сервис.Форма.ИнициализацияСотрудник",ДопПарметрыФормы, ЭтаФорма,,,,опЗакрытие, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры




&НаКлиенте
Процедура Подключаемый_ОчиститьНомерСтрокиДляПодсветки()
	
	НомерСтрокиДляПодсветки = Неопределено;
	
КонецПроцедуры


&НаКлиенте
Процедура Подключаемый_ТекущаяСтрока()
	
	Элементы.Документы.ТекущаяСтрока = ТекИдентификаторСтроки;
	
КонецПроцедуры

 
&НаКлиенте
Процедура ПодсветитьСтроку(ИдентификаторСтроки)
	
	СтрокаДок = Объект.Документы.НайтиПоИдентификатору(ИдентификаторСтроки);
	
	Если НЕ СтрокаДок = Неопределено Тогда
		
		НомерСтрокиДляПодсветки = СтрокаДок.НомерСтроки;
		
		ПодключитьОбработчикОжидания("Подключаемый_ТекущаяСтрока", 1,Истина);
		
		
		ИнтервалСек = 2;
		ПодключитьОбработчикОжидания("Подключаемый_ОчиститьНомерСтрокиДляПодсветки", ИнтервалСек,Истина);
	КонецЕсли;
	
КонецПроцедуры




 &НаКлиенте
Процедура ОповещениеПриемТоваровPKG(Результат, Параметры)Экспорт
	
	Если Результат = Неопределено Тогда
		ПодсветитьСтроку(ТекИдентификаторСтроки);

		Возврат;
	КонецЕсли;

	
	МСтрокиКороб =  Объект.Короба.НайтиСтроки(Новый Структура("ИД_Короб",Результат.ИД_Короб));
	СтрокаКроб = МСтрокиКороб[0];
	СтрокаКроб.Принят = 1;
	
	МСтрокиДокумент=  Объект.Документы.НайтиСтроки(Новый Структура("ИД_Документ",Результат.ИД_Документ));
	СтрокаДокумент = МСтрокиДокумент[0];       
	СтрокаДокумент.ПринятоPKG = ПринятоPKGДокумента(Результат.ИД_Документ);
	СтрокаДокумент.ЗаписьПоСтроке = "Прийнято PKG - "+СтрокаДокумент.ПринятоPKG+" з "+СтрокаДокумент.ВсегоPKG+Символы.ПС+СтрокаДокумент.СкладСборки;
	Для Каждого ТоварPKG Из Результат.ТоварыPKG Цикл 
		МассивТоварыPKG = Объект.Товары.НайтиСтроки(Новый Структура("ИД_Короб,Артикул,МРЦ",Результат.ИД_Короб,ТоварPKG.Артикул,ТоварPKG.МРЦ));  
		СтрокаТоварPKG = МассивТоварыPKG[0];
		СтрокаТоварPKG.КоличествоВведено = ТоварPKG.КоличествоВведено;
		СтрокаТоварPKG.КоличествоРасхождение = ТоварPKG.КоличествоРасхождение;
		СтрокаТоварPKG.ПричинаРасхождения = ТоварPKG.ПричинаРасхождения;   
	КонецЦикла;    
	
	ПодсветитьСтроку(ТекИдентификаторСтроки);
	
КонецПроцедуры




&НаКлиенте
Процедура Записать(Команда)
	ОчиститьСообщения();
	Если Объект.Документы.Количество() = 0 Тогда
		Сообщить("Нема документів для запису!");
		Возврат;
	КонецЕсли;
	Если ПроверкаСервер() Тогда
		  Возврат;
	 КонецЕсли;
	 
	 
	МассивДокументовБезPKG = ПроверитьСтрокиПриема();
	
	ЗакончитьПриемPKG(МассивДокументовБезPKG);
	
	
КонецПроцедуры

Функция ПроверкаСервер() 
	Рез = Ложь;	
	Если ПустаяСтрока(ПараметрыСеанса.Сотрудник) Тогда
		Сообщить("Користувач не ініціалізований");
		Рез = Истина;
	КонецЕсли;
  	Возврат Рез;
КонецФункции

&НаСервере
Функция ПроверитьСтрокиПриема()
	
	МассивДокументовБезPKG = Новый Массив;

	Если ТипДокумента = Справочники.ТипыДокументов.БезакцептныйПриемPKG Тогда
		Возврат МассивДокументовБезPKG;
	КонецЕсли;

	Для Каждого ДокументПриема Из Объект.Документы Цикл 
		ВсегоPKG_ВДокументе = ДокументПриема.ВсегоPKG;
		
		КоличествоПринято = ПринятоPKGДокумента(ДокументПриема.ИД_Документ);   
		Если ВсегоPKG_ВДокументе <> КоличествоПринято И НЕ КоличествоПринято = 0 Тогда  
			МассивДокументовБезPKG.Добавить(
			Новый Структура("ИД_Документ,Номер,Дата,ВсегоPKG,ПринятоPKG"
			,ДокументПриема.ИД_Документ,ДокументПриема.Номер,ДокументПриема.Дата,ВсегоPKG_ВДокументе,КоличествоПринято));
		КонецЕсли;
		
		
	КонецЦикла;
	
	Возврат МассивДокументовБезPKG;
	
КонецФункции

 &НаКлиенте
Асинх Процедура ЗакончитьПриемPKG(МассивДокументовБезPKG)
	
	Если ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.БезакцептныйПриемPKG") Тогда
		ТекстВопроса =	"Закінчити безакцептний прийом PKG?";
	ИначеЕсли МассивДокументовБезPKG.Количество() Тогда
		ФорматТекстВопроса = "Прийняті не всі PKG за документами"+Символы.ПС+"<<Важливо ! на невідскановий ПКГ буде сформований Акт розбіжності>>";
		ТекстВопроса = Новый ФорматированнаяСтрока(ФорматТекстВопроса, Новый Шрифт(,,11),Новый Цвет(255, 0, 0));

	Иначе
		ТекстВопроса ="Закінчити прийом PKG?";
	КонецЕсли;
	
    Режим = РежимДиалогаВопрос.ДаНет;
    Ответ = Ждать ВопросАсинх(ТекстВопроса, Режим, 0);
    Если Ответ = КодВозвратаДиалога.Нет Тогда
        Возврат;
	КонецЕсли;  
	
	РезультатВыгрузки = ВыгрузитьРезультатыСканирования();
	Если НЕ РезультатВыгрузки.Результат Тогда  
		Если НЕ ПустаяСтрока(РезультатВыгрузки.ОписаниеОшибки) Тогда
			Сообщить(РезультатВыгрузки.ОписаниеОшибки); 
		КонецЕсли;
		
		Возврат; 
	Иначе
		Объект.Документы.Очистить();
		Объект.Короба.Очистить();
		Объект.Товары.Очистить();
		Оповестить("ОбновитьЗадания");	
		Если РезультатВыгрузки.Ответ.Свойство("ПечатьАкт") Тогда
			ОбщегоНазначенияКлиент.ВывестиПДФ_НаПечать(Base64Значение(РезультатВыгрузки.Ответ.ПечатьАкт));
		КонецЕсли;
		
	КонецЕсли; 
	
	ВыполняетсяЗакрытие = Истина;
	Закрыть();
	
	
КонецПроцедуры

&НаСервере
Функция ВыгрузитьРезультатыСканирования()
	
	СтруктураДокумента = Новый Структура; 
	СтруктураДокумента.Вставить("UUID_Сотрудник",ПараметрыСеанса.Сотрудник_ID);

	МассивДокументы = Новый Массив;  
	МасивДокНаВыгрузку = Новый Массив;
	СтрокаСтруктура = "ИД_Документ,ВсегоPKG,РК";
	Для Каждого ТекДокумент Из Объект.Документы Цикл
		Если ТекДокумент.ВсегоPKG <> ТекДокумент.ПринятоPKG И ТекДокумент.ПринятоPKG = 0 Тогда
			Продолжить;
		КонецЕсли;
		МасивДокНаВыгрузку.Добавить(ТекДокумент.ИД_Документ);
		СтруктураДокументПриема = Новый Структура(СтрокаСтруктура);
		ЗаполнитьЗначенияСвойств(СтруктураДокументПриема,ТекДокумент);
		МассивДокументы.Добавить(СтруктураДокументПриема);
	КонецЦикла;  
	Если МасивДокНаВыгрузку.Количество() = 0 Тогда
       	Возврат Новый Структура("Результат,ОписаниеОшибки",Ложь,"Немає прийнятих документів");
	КонецЕсли;
	
	
	СтруктураДокумента.Вставить("Документы",МассивДокументы);
	
	МассивКороба = Новый Массив;
	СтрокаСтруктура = "ИД_Короб,ИД_Документ,Принят,Отсканирован,НомерУпаковки,РК";
	Для Каждого ТекКороб Из Объект.Короба Цикл 
		Если МасивДокНаВыгрузку.Найти(ТекКороб.ИД_Документ) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураКоробаПриема = Новый Структура(СтрокаСтруктура);
		ЗаполнитьЗначенияСвойств(СтруктураКоробаПриема,ТекКороб);
		МассивКороба.Добавить(СтруктураКоробаПриема);
	КонецЦикла;
	СтруктураДокумента.Вставить("Короба",МассивКороба);
	
	МассивТовары = Новый Массив;
   	СтрокаСтруктура = "ИД_Документ,ИД_Короб,Артикул,Коэффициент,КоличествоПоставщика,КоличествоВведено,КоличествоРасхождение,КодПричины,МРЦ";
	Для Каждого ТекТовар Из Объект.Товары Цикл 
		Если МасивДокНаВыгрузку.Найти(ТекТовар.ИД_Документ) = Неопределено Тогда
			Продолжить;
		КонецЕсли;

		СтруктураТоварПриема = Новый Структура(СтрокаСтруктура);
		ЗаполнитьЗначенияСвойств(СтруктураТоварПриема,ТекТовар);
		СтруктураТоварПриема.КодПричины = ?(ЗначениеЗаполнено(ТекТовар.ПричинаРасхождения),ТекТовар.ПричинаРасхождения.Код,"");
		МассивТовары.Добавить(СтруктураТоварПриема);
	КонецЦикла;
	СтруктураДокумента.Вставить("Товары",МассивТовары);
	
	
	СтруктураОтвет = РозницаТК.ВыгрузитьДокументПриемРЦ(СтруктураДокумента,ПредварительныйПрием);   
	Возврат СтруктураОтвет;
	
КонецФункции

&НаКлиенте
Процедура ВыборДокумента(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка) 
	СтандартнаяОбработка = Ложь;   
	Если ПредварительныйПрием ИЛИ ПользовательИнициализирован = Ложь Тогда
		Возврат;
	КонецЕсли; 
	
	
	ТекущиеДанные = Элементы.Документы.ТекущиеДанные;
	ТекИдентификаторСтроки = ТекущиеДанные.ПолучитьИдентификатор();
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОповещениеПриемТоваровPKG", ЭтотОбъект);
	
	мКороба = Объект.Короба.НайтиСтроки(Новый Структура("ИД_Документ",ТекущиеДанные.ИД_Документ));
	Если мКороба.Количество() Тогда
	//	ОткрытьФорму("Обработка.Розница.Форма.ФормаТоварыКороба"
	//		,Новый Структура("ТипДокумента,ИД_Короб,ИД_Документ,Товары,Документы,Короба",ТипДокумента,мКороба[0].ИД_Короб,ТекущиеДанные.ИД_Документ,Объект.Товары,Объект.Документы,Объект.Короба)
	//		,ЭтотОбъект,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);	
	//	
	//Иначе
		ОткрытьФорму("Обработка.Розница.Форма.ФормаКороба"
			,Новый Структура("ТипДокумента,ИД_Документ,Товары,Документы,Короба"
			,ТипДокумента
			,ТекущиеДанные.ИД_Документ
			,Объект.Товары,Объект.Документы,Объект.Короба)
			,ЭтотОбъект,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс); 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;    
КонецПроцедуры

&НаКлиенте
Процедура ДокументыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДокументыПередНачаломИзменения(Элемент, Отказ)
    Отказ = Истина;   
	Если ПредварительныйПрием ИЛИ ПользовательИнициализирован = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	ВыборДокумента(Элемент,,,);
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры
